/*************************************************************************
	> File Name: pgid.c
	> Author: 陈琳耀 || C01
	> Mail: 1003192057@qq.com 
	> Created Time: 2017年06月03日 星期六 20时40分22秒
 ************************************************************************/

#include "../header.h"

int main()
{
    //父进程
    pid_t pid1 = fork();
    if (pid1 == 0)
    {
        //将子进程组独立出来，自己当组长
        //此时父进程的组就被独立出来了
        setpgid(getpid(), getpid());

        //子进程
        pid_t pid2 = fork();
        if (pid2 == 0)
        {
            //孙子进程
        }
    }

    getchar();
}
